Tekla.Structures.Drawing.PickerInputPointsWithinAView
The PickerInputPointsWithinAView class is the base class of PickerInput instances that represent
a pick of one or more points in a view.

Tekla.Structures.Drawing.PickerInputPointsWithinAView.PickedPoints
Gets or sets the picked points.

Tekla.Structures.Drawing.PickerInputPointsWithinAView.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PickerInputPointsWithinAView.#ctor(Tekla.Structures.Drawing.ViewBase)
Initializes a new instance of the Tekla.Structures.Drawing.PickerInputPointsWithinAView class.
pickedView: The view in which the pick occurred.

Tekla.Structures.Drawing.PickerInputPointsWithinAView.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList)
Creates a new PickerInputPointsWithinAView instance representing N points selected in a view.
pickedView: The view in which the pick occurred.
pickedPoints: The list of picked points in the view coordinates.